[{"SCORE":"97","SaleEnds":"2023-03-06","description":"Includes Red Dead Redemption 2: Story Mode and Red Dead Online. Winner of over 175 Game of the Year Awards and recipient of over 250 perfect scores, Red Dead Redemption 2 is an epic tale of honor and loyalty at the dawn of the modern age. America, 1899. Arthur Morgan and the Van der Linde gang are outlaws on the run. With federal agents and the best bounty hunters in the nation massing on their heels, the gang must rob, steal and fight their way across the rugged heartland of America in order to survive. As deepening internal divisions threaten to tear the gang apart, Arthur must make a choice between his own ideals and loyalty to the gang who raised him. Red Dead Redemption 2 also includes the shared living world of Red Dead Online – forge your own path as you battle lawmen, outlaw gangs and ferocious wild animals to build a life on the American frontier. Build a camp, ride solo or form a posse and explore everything from the snowy mountains in the North to the swamps of the South, from remote outposts to busy farms and bustling towns. Chase down bounties, hunt, fish and trade, search for exotic treasures, run your own underground Moonshine distillery, or become a Naturalist to learn the secrets of the animal kingdom and much more in a world of astounding depth and detail – includes all new features, gameplay content and additional enhancements released since launch.","SaleStarted":"2023-02-19","LowestPrice":"/game/27100","Image":"https://image.api.playstation.com/cdn/UP1004/CUSA03041_00/Hpl5MtwQgOVF9vJqlfui6SDB5Jl4oBSq.png?w=200","MainStory":49,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1004-CUSA08519_00-REDEMPTIONFULL02","Trailer":"https://www.youtube.com/watch?v=HVRzx17WHVk","PercentOff":"67%","Completionist":177,"genre":"Action, Adventure, Unique","PlusPrice":154.77,"MexPrice":"https://image.api.playstation.com/cdn/UP1004/CUSA03041_00/Hpl5MtwQgOVF9vJqlfui6SDB5Jl4oBSq.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-4/red-dead-redemption-2","Title":"Red Dead Redemption 2","ESRBRating":"TRD","Publisher":"Rockstar Games","ReleaseDate":"2018-10-25","Slug":"red-dead-redemption-2-playstation-tr","NumberofPlayers":"https://shope.ee/4KmAYzHiBW","IsPS5":0,"Price":469,"MainExtra":80,"SalePrice":154.77,"IsPS4":1},{"SCORE":"87","SaleEnds":"2023-03-06","description":"Originally created by legendary game designer Sid Meier, Civilization is a turn-based strategy game in which you attempt to build an empire to stand the test of time. Explore a new land, research technology, conquer your enemies, and go head-to-head with history’s most renowned leaders as you attempt to build the greatest civilization the world has ever known. Civilization VI for PlayStation®4 includes the latest game updates and improvements and four pieces of additional content which adds four new civilizations, leaders, and scenarios: •Vikings Scenario Pack •Poland Civilization & Scenario Pack •Australia Civilization & Scenario Pack •Persia and Macedon Civilization & Scenario Pack Those who purchase Civilization VI for PlayStation®4 will also receive as a bonus the following pieces of additional content: •Nubia Civilization & Scenario Pack •Khmer and Indonesia Civilization & Scenario Pack","SaleStarted":"2023-02-19","LowestPrice":"/game/37867","Image":"https://image.api.playstation.com/vulcan/img/cfn/11307KFcs3gBlcheONy-ZOYZ5kplFnq5jXinUSI8HkCc8P2gdI1_32JrKJ-vxns32LjXBcQteG2EOwuzWS_KXqE5VCYFmS4Z.png?w=200","MainStory":22,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-CUSA15381_00-CIV6BASE00000000","Trailer":"https://www.youtube.com/watch?v=yKUFvo3_FYQ","PercentOff":"80%","Completionist":292,"genre":"Strategy, Strategy","PlusPrice":51.8,"MexPrice":"https://image.api.playstation.com/vulcan/img/cfn/11307KFcs3gBlcheONy-ZOYZ5kplFnq5jXinUSI8HkCc8P2gdI1_32JrKJ-vxns32LjXBcQteG2EOwuzWS_KXqE5VCYFmS4Z.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-4/sid-meiers-civilization-vi","Title":"Sid Meier’s Civilization VI","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2019-11-21","Slug":"sid-meiers-civilization-vi-playstation-tr","NumberofPlayers":"https://shope.ee/2fdwZuB3Tf","IsPS5":0,"Price":259,"MainExtra":78,"SalePrice":51.8,"IsPS4":1},{"SCORE":"85","SaleEnds":"2023-03-06","description":"Lost in transit while on a colonist ship bound for the furthest edge of the galaxy, you awake decades later than you expected only to find yourself in the midst of a deep conspiracy threatening to destroy the Halcyon colony. As you explore the furthest reaches of space and encounter a host of factions all vying for power, who you decide to become will determine the fate of everyone in Halcyon. In the corporate equation for the colony, you are the unplanned variable. Welcome to the future - try not to break it. • Build any character you want in this thrilling single-player first person RPG - including optional flaws based on your own game experience • Lead a crew of companions armed with unique abilities that have their own missions, motivations and ideals • Find your ship and explore the settlements, space stations and other diverse locations in the Halcyon colony","SaleStarted":"2023-02-19","LowestPrice":"/game/62935","Image":"https://image.api.playstation.com/vulcan/img/cfn/11307DWVuREjDv3JnXusQxTjHIJHzhxx2_CUkUzQhzwYe5KUktTVe2_rFsnYYa1hMNlqHrWemXr0Nut__AF2KWPJp84uBZvf.png?w=200","MainStory":13,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP4829-CUSA13689_00-THEOUTERWORLDS01","Trailer":"https://www.youtube.com/watch?v=h5LaYTtIkag","PercentOff":"34%","Completionist":38,"genre":"Action, Role Playing Games","PlusPrice":256.74,"MexPrice":"https://image.api.playstation.com/vulcan/img/cfn/11307DWVuREjDv3JnXusQxTjHIJHzhxx2_CUkUzQhzwYe5KUktTVe2_rFsnYYa1hMNlqHrWemXr0Nut__AF2KWPJp84uBZvf.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-4/the-outer-worlds","Title":"The Outer Worlds","ESRBRating":"TRD","Publisher":"TAKE-TWO INTERACTIVE SOFTWARE UK","ReleaseDate":"2019-10-24","Slug":"the-outer-worlds-playstation-tr","NumberofPlayers":"https://shope.ee/5zuOY2Kuix","IsPS5":0,"Price":389,"MainExtra":26,"SalePrice":256.74,"IsPS4":1},{"SCORE":"83","SaleEnds":"2023-03-06","description":"Lost, alone and separated from family, a stray cat must untangle an ancient mystery to escape a long-forgotten city. Stray is a third-person cat adventure game set amidst the detailed, neon-lit alleys of a decaying cybercity and the murky environments of its seedy underbelly. Roam surroundings high and low, defend against unforeseen threats and solve the mysteries of this unwelcoming place inhabited by curious droids and dangerous creatures. See the world through the eyes of a cat and interact with the environment in playful ways. Be stealthy, nimble, silly, and sometimes as annoying as possible with the strange inhabitants of this mysterious world. Along the way, the cat befriends a small flying drone, known only as B-12. With the help of this newfound companion, the duo must find a way out. Stray is developed by BlueTwelve Studio, a small team from the south of France mostly made up of cats and a handful of humans.","SaleStarted":"2023-02-19","LowestPrice":"/game/79790","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202206/0300/E2vZwVaDJbhLZpJo7Q10IyYo.png?w=200","MainStory":5,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP2333-PPSA02101_00-STRAYSIEE0000000","Trailer":"https://www.youtube.com/watch?v=_rkopP_9qis","PercentOff":"20%","Completionist":9,"genre":"Adventure","PlusPrice":0,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202206/0300/E2vZwVaDJbhLZpJo7Q10IyYo.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-5/stray","Title":"Stray","ESRBRating":"TRD","Publisher":"Annapurna Interactive","ReleaseDate":"2022-07-19","Slug":"stray-playstation-tr","NumberofPlayers":"https://shope.ee/VZRzpi06T","IsPS5":1,"Price":259,"MainExtra":6,"SalePrice":207.2,"IsPS4":1},{"SCORE":"81","SaleEnds":"2023-03-06","description":"Includes Grand Theft Auto V: Story Mode and Grand Theft Auto Online. Continue your journey on PS5™ and transfer both GTAV Story Mode progress and GTA Online characters and progression to PS5™ with a one-time migration. Experience entertainment blockbusters, Grand Theft Auto V and GTA Online — now for PS5™. PS5™ players can enjoy new high-performance vehicle upgrades and improvements like the Career Builder as well as all GTA Online gameplay upgrades, expansions, and access to all current and previous content updates, ready to enjoy solo or with friends. Pull off daring co-operative Heists, enter adrenaline-fueled Stunt Races, compete in unique Adversary Modes, or hang out in social spaces including nightclubs, arcades, penthouse parties, car meetups, and much more. Explore Los Santos and Blaine County in greater detail than ever before, now featuring: • STUNNING VISUALS — Enhanced levels of fidelity and performance with new graphics modes featuring up to 4K resolution, up to 60 frames per second, HDR options, ray tracing, improved texture quality, and more • FASTER LOADING — Quicker access to the action as the world of Los Santos and Blaine County load in faster than ever before • ADAPTIVE TRIGGERS AND HAPTIC FEEDBACK — Feel every moment through the DualSense™ controller, from directional damage to weather effects, rough road surfaces to explosions, and more • TEMPEST 3D AUDIO — Hear the sounds of the world with pinpoint precision: the throttle of a stolen supercar, the rattle of neighboring gunfire, the roar of a helicopter overhead, and more Plus, all-new enhancements to the ever-evolving world of GTA Online, including: • EXCLUSIVE NEW CONTENT — Step into Hao’s Special Works at the Los Santos Car Meet, featuring elite new vehicle upgrades and exclusive modifications. Then take these high-performance vehicles into HSW races, new time trials, and more. • THE CAREER BUILDER — Get started in GTA Online with the tools of the trade. Quickly choose from one of four illicit businesses — Biker, Executive, Nightclub Owner, or Gunrunner — and select from properties, powerhouse vehicles, and weaponry to kick-start your enterprise. • NEW MENU DESIGN — Immediately access everything GTA Online has to offer right from the Main Menu, including the latest and most popular updates • ACCESS TO ALL CURRENT AND PREVIOUS UPDATES — Dive into more than 40 massive updates with more to come, featuring everything from the high-stakes hunt for Dr. Dre’s missing music files with Franklin Clinton in The Contract to the high-octane underground street racing action of Los Santos Tuners; Heists on the lush tropical island of Cayo Perico to the nightlife circuit of After Hours and The Diamond Casino & Resort; all available alongside a wide range of races, modes, activities, and social spaces to enjoy solo or with friends — including golf courses, nightclubs, arcades, poolside lounges, and much more","SaleStarted":"2023-02-19","LowestPrice":"/game/4064","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202202/2811/x9SuHZAiRn0uJXB1IKteIgcw.png?w=200","MainStory":31,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1004-PPSA01721_00-GTAOANDSPUPGRADE","Trailer":"https://www.youtube.com/watch?v=QkkoHAzjnUs","PercentOff":"50%","Completionist":81,"genre":"Action, Adventure","PlusPrice":219.5,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202202/2811/x9SuHZAiRn0uJXB1IKteIgcw.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-5/grand-theft-auto-v","Title":"Grand Theft Auto V (PlayStation®5)","ESRBRating":"TRD","Publisher":"Rockstar Games","ReleaseDate":"2022-03-14","Slug":"grand-theft-auto-v-playstation5-playstation-tr","NumberofPlayers":"https://shope.ee/20OFmcg9nk","IsPS5":1,"Price":439,"MainExtra":49,"SalePrice":219.5,"IsPS4":0},{"SCORE":"79","SaleEnds":"2023-03-06","description":"Rollerdrome is a singleplayer third person action shooter that seamlessly blends high-octane combat with fluid motion to create an action experience like no other. Dominate with style in cinematic, visceral combat where kills net you health and pulling off tricks and grinds provide you ammunition, in this adrenaline-pumping action shooter. The year is 2030. In a world where corporations rule and the lines between reality and performance are blurred, the public are kept distracted by the violence and excess of a brutal new blood sport — Rollerdrome. Will you have what it takes to become the Rollerdrome champion and unravel the mysteries behind the Matterhorn corporation’s true intentions? From Roll7, the minds that brought you the award winning and critically acclaimed OlliOlli series comes Rollerdrome, an intense shooter-skater hybrid set in an evocative retrofuture. Key Features: ● A third person action shooter like no other – an original hybrid shooter-skater that blends high octane, visceral combat with fluid movement and tricking mechanics into one complementary and challenging whole. ● A test of skill – Take on a unique challenge throughout the Rollerdrome tournament. Establish your dominance in the field with online leaderboards and push yourself to the limit with the unlockable \"Out For Blood\" mode for the most extreme test of skill and agility. ● An original identity – An all-new fully original soundtrack that merges iconic era sounds and tones with cutting edge production to provide a heart-thumping backdrop to the carnage, brought to life with a unique comic-book inspired art style. ● A dark conspiracy – Discover a mysterious, sinister plot in this distinct retrofuture universe.","SaleStarted":"2023-02-19","LowestPrice":"/game/108879","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202206/0222/eBvlHH5Jv3QHrIwzrdbKlkdj.png?w=200","MainStory":4,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP4829-CUSA34254_00-ROLLERDROME00000","Trailer":"https://www.youtube.com/watch?v=2mns9HMvREA","PercentOff":"34%","Completionist":12,"genre":"Shooter, Sport","PlusPrice":999999,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202206/0222/eBvlHH5Jv3QHrIwzrdbKlkdj.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-5/rollerdrome","Title":"Rollerdrome","ESRBRating":"TRD","Publisher":"TAKE-TWO INTERACTIVE SOFTWARE UK","ReleaseDate":"2022-08-16","Slug":"rollerdrome-playstation-tr","NumberofPlayers":"https://shope.ee/AwbbCwsAi","IsPS5":1,"Price":379,"MainExtra":7,"SalePrice":250.14,"IsPS4":1},{"SCORE":"79","SaleEnds":"1990-01-01","description":"The PlayStation Plus Premium Game Trial duration for Rollerdrome is 35 minutes (not 1-hour). Rollerdrome is a singleplayer third person action shooter that seamlessly blends high-octane combat with fluid motion to create an action experience like no other. Dominate with style in cinematic, visceral combat where kills net you health and pulling off tricks and grinds provide you ammunition, in this adrenaline-pumping action shooter. The year is 2030. In a world where corporations rule and the lines between reality and performance are blurred, the public are kept distracted by the violence and excess of a brutal new blood sport — Rollerdrome. Will you have what it takes to become the Rollerdrome champion and unravel the mysteries behind the Matterhorn corporation’s true intentions? From Roll7, the minds that brought you the award winning and critically acclaimed OlliOlli series comes Rollerdrome, an intense shooter-skater hybrid set in an evocative retrofuture. Key Features: ● A third person action shooter like no other – an original hybrid shooter-skater that blends high octane, visceral combat with fluid movement and tricking mechanics into one complementary and challenging whole. ● A test of skill – Take on a unique challenge throughout the Rollerdrome tournament. Establish your dominance in the field with online leaderboards and push yourself to the limit with the unlockable \"Out For Blood\" mode for the most extreme test of skill and agility. ● An original identity – An all-new fully original soundtrack that merges iconic era sounds and tones with cutting edge production to provide a heart-thumping backdrop to the carnage, brought to life with a unique comic-book inspired art style. ● A dark conspiracy – Discover a mysterious, sinister plot in this distinct retrofuture universe.","SaleStarted":"1989-12-17","LowestPrice":"/game/108879","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202206/0222/eBvlHH5Jv3QHrIwzrdbKlkdj.png?w=200","MainStory":4,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP4829-PPSA08186_00-ROLLERDROME00000","Trailer":"https://www.youtube.com/watch?v=2mns9HMvREA","PercentOff":"0","Completionist":12,"genre":"Shooter, Sport","PlusPrice":999999,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202206/0222/eBvlHH5Jv3QHrIwzrdbKlkdj.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-5/rollerdrome","Title":"Rollerdrome","ESRBRating":"TRD","Publisher":"TAKE-TWO INTERACTIVE SOFTWARE UK","ReleaseDate":"2022-08-16","Slug":"rollerdrome-playstation-tr","NumberofPlayers":"https://shope.ee/AwbbCwsAi","IsPS5":1,"Price":999999,"MainExtra":7,"SalePrice":999999,"IsPS4":0},{"SCORE":"78","SaleEnds":"2023-03-06","description":"Rise to the occasion and realize your full potential in NBA 2K23. Prove yourself against the best players in the world and showcase your talent in MyCAREER or The W. Pair today’s All-Stars with timeless legends in MyTEAM. Build a dynasty of your own as a GM, or lead the league in a new direction as the Commissioner in MyNBA. Take on NBA or WNBA teams in PLAY NOW and experience true-to-life gameplay. How will you Answer The Call? • The next evolution of ultra-real gameplay has arrived on New Gen with NBA 2K23. New ways to attack off the dribble and at the rim are matched against an intuitive 1-on-1 positional shading system to unlock even more control on both ends of the floor in the most authentic basketball experience yet. • The City is yours for the taking in the most immersive MyCAREER journey to date. Hone your game, build your brand, and decide how you write your story on and off the court. Choose your crew and take on the best MyPLAYERs inside an all-new City, primed with breathtaking views, arenas, and courts ready for you to call next. • Step back in time with era-specific visuals that captured Michael Jordan’s ascension from collegiate sensation to global icon with immersive Jordan Challenges chronicling his career-defining dominance. Lace up his shoes to recreate his otherworldly stat lines and iconic last shots, while listening to first-hand accounts from those who witnessed his maturation from budding star to basketball legend. • Ball without limits as you collect and assemble a bevy of legendary talent from any era in MyTEAM. Dominate the hardwood each Season, and bring your vision to life with a broad set of customization tools to create the perfect look for your perfect starting five.","SaleStarted":"2023-02-19","LowestPrice":"/game/110880","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202206/2200/vLdTCoRLhhHmAAqRypgAOlAI.png?w=200","MainStory":11,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-PPSA07170_00-NBA2K23000000000","Trailer":"https://www.youtube.com/watch?v=RxLS5Tgo9YM","PercentOff":"70%","Completionist":0,"genre":"Sports","PlusPrice":999999,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202206/2200/vLdTCoRLhhHmAAqRypgAOlAI.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-5/nba-2k23","Title":"NBA 2K23 for PS5™","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-09-08","Slug":"nba-2k23-for-ps5-playstation-tr","NumberofPlayers":"https://shope.ee/VZRzo9YCQ","IsPS5":1,"Price":899,"MainExtra":0,"SalePrice":269.7,"IsPS4":0},{"SCORE":"78","SaleEnds":"2023-03-06","description":"This product entitles you to download both the digital PS4™ version and the digital PS5™ version of this game. PlayStation®4 copies of Borderlands 3 include a digital upgrade to the fully optimized for PlayStation®5 version! Experience the game in gorgeous 4K resolution at up to 60 fps in single-player and online co-op. Add more couch co-op mayhem with expanded local splitscreen support for up to 4 players. The original shooter-looter returns, packing bazillions of guns and a mayhem-fueled adventure! Blast through new worlds and enemies as one of four new Vault Hunters. Play solo or with friends to take on insane enemies, score loads of loot and save your home from the most ruthless cult leaders in the galaxy. A MAYHEM-FUELED THRILL RIDE Stop the fanatical Calypso Twins from uniting the bandit clans and claiming the galaxy’s ultimate power. YOUR VAULT HUNTER, YOUR PLAYSTYLE Become one of 4 new Vault Hunters, each with deep skill trees, abilities and customization. LOCK, LOAD, AND LOOT With bazillions of guns and gadgets, every fight is an opportunity to score new gear. NEW BORDERLANDS Discover new worlds beyond Pandora, each with unique environments and enemies. QUICK & SEAMLESS CO-OP ACTION Play with anyone at any time online or in split-screen co-op, regardless of your level or mission progress. If you already own the PS4™ version of this game, you can get the PS5™ digital version at no extra cost and you do not need to purchase this product. Owners of a PS4™ disc copy must insert it into the PS5™ every time they want to download or play the PS5™ digital version. PS4™ game disc owners who buy the PS5™ Digital Edition disc-free console will not be able to get the PS5™ version at no extra cost.","SaleStarted":"2023-02-19","LowestPrice":"/game/65882","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202010/2323/p50N4PBK9rNanGYKFecTvac5.png?w=200","MainStory":22,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-PPSA01463_00-0000000OAKNGSIEE","Trailer":"https://www.youtube.com/watch?v=LkHNbsQMxPI","PercentOff":"85%","Completionist":71,"genre":"Shooter, Action, Unique","PlusPrice":0,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202010/2323/p50N4PBK9rNanGYKFecTvac5.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-4/borderlands-3","Title":"Borderlands 3 PS4™ &  PS5™","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2020-11-11","Slug":"borderlands-3-ps4---ps5-playstation-tr","NumberofPlayers":"https://shope.ee/6pTVXXE0od","IsPS5":1,"Price":459,"MainExtra":43,"SalePrice":68.85,"IsPS4":1},{"SCORE":"74","SaleEnds":"2023-03-06","description":"As the sun sets on the last day of summer camp, the counselors of Hackett’s Quarry throw a party to celebrate. Things quickly take a turn for the worse. Hunted by blood-drenched locals and something far more sinister, the teens' party plans unravel into an unpredictable night of horror. Play as each of the nine counselors in a thrilling cinematic tale, where every decision shapes your story. YOUR STORY, THEIR FATE Will you save your friends or run for your life? Every choice, big or small, shapes your story and determines who lives to tell the tale. A STUNNING CINEMATIC EXPERIENCE Cutting edge facial capture and filmic lighting techniques, combined with incredible performances from an iconic cast of Hollywood talent, bring the horrors of Hackett’s Quarry to life. ENJOY THE FRIGHT WITH FRIENDS Play with up to 7 friends online*, where invited players watch along and vote on key decisions, creating a story shaped by the whole group! Or, play together in a party horror couch co-op experience where each player controls a counselor. CUSTOMIZE YOUR EXPERIENCE Adjustable difficulty lets players of any skill level enjoy the horror, while Movie Mode lets you enjoy The Quarry as a binge-worthy cinematic thriller. STARRING: David Arquette as Chris Ariel Winter as Abigail Brenda Song as Kaitlyn Evan Evagora as Nick Halston Sage as Emma Justice Smith as Ryan Miles Robbins as Dylan Siobhan Williams as Laura Skyler Gisondo as Max Zach Tinker as Jacob Ethan Suplee as Bobby Grace Zabriskie as Eliza Lance Henriksen as Jedediah Lin Shaye as Constance Ted Raimi as Travis * Online multiplayer functionality will be available post-launch on or by July 8, 2022. Multiplayer functionality across same generation only.","SaleStarted":"2023-02-19","LowestPrice":"/game/105741","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202203/0501/FUr3M0kGxyddUfUeuKBBFf2w.png?w=200","MainStory":9,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-PPSA06225_00-7789207353273926","Trailer":"https://www.youtube.com/watch?v=Zh2K7SxRHmo","PercentOff":"50%","Completionist":30,"genre":"Horror","PlusPrice":0,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202203/0501/FUr3M0kGxyddUfUeuKBBFf2w.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-5/the-quarry","Title":"The Quarry for PS5™","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-06-09","Slug":"the-quarry-for-ps5-playstation-tr","NumberofPlayers":"https://shope.ee/8UbjWY4LGC","IsPS5":1,"Price":699,"MainExtra":10,"SalePrice":349.5,"IsPS4":0},{"SCORE":"70","SaleEnds":"2023-03-06","description":"The Outer Worlds: Peril on Gorgon is the first narrative expansion to the award-winning RPG from Obsidian Entertainment and Private Division. A severed arm and a mysterious message lead the crew of the Unreliable to the Gorgon Asteroid, formerly the site of one of Halcyon’s most ambitious and disastrous scientific undertakings, now a lawless den of monsters and marauders. Wealthy recluse Minnie Ambrose tasks the crew with finding answers about Dr. Olivia Ambrose, her mother and the doomed project’s disgraced director, but they are soon ensnared in an intrigue that will change the colony forever. Key Features: • Intrigue and danger: Search an abandoned Spacer’s Choice facility and encounter a cast of new characters as you uncover the mystery behind the sudden cancellation of the Gorgon Project. • New locations: Explore the treacherous canyons of the Gorgon Asteroid and encounter enemies that have been warped by science. • More science weapons: Discover three outlandish new science weapons, including the P.E.T. (Pest Extermination Tool), an exciting new melee weapon that draws in enemies for close-range attacks. • Expanded character customization and lore: An increased level cap, additional perks and flaws, wholly new armor sets, and several variants for existing gear. Plus, dig into the story of the Gorgon Asteroid with new Portable Phonograph audio logs that reveal the salacious secrets of a scientific experiment gone wrong. The Outer Worlds: Peril on Gorgon is the first of two narrative expansions that can be purchased individually or bundled at a discount in The Outer Worlds Expansion Pass. A copy of The Outer Worlds required to play expansion.","SaleStarted":"2023-02-19","LowestPrice":"/game/81114","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202008/1219/8y2yIylLf83HU0fbT6NptUu6.png?w=200","MainStory":4,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP4829-CUSA13689_00-OUTERWORLDSDLC01","Trailer":"https://www.youtube.com/watch?v=AFy0B2ZTmVE","PercentOff":"35%","Completionist":14,"genre":"Action, Role Playing Games","PlusPrice":93.6,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202008/1219/8y2yIylLf83HU0fbT6NptUu6.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-4/the-outer-worlds-peril-on-gorgon","Title":"The Outer Worlds: Peril on Gorgon","ESRBRating":"TRD","Publisher":"TAKE-TWO INTERACTIVE SOFTWARE UK","ReleaseDate":"2020-09-09","Slug":"the-outer-worlds-peril-on-gorgon-playstation-tr","NumberofPlayers":"https://shope.ee/4V5alGihCi","IsPS5":0,"Price":144,"MainExtra":8,"SalePrice":93.6,"IsPS4":1},{"SCORE":"64","SaleEnds":"2023-03-06","description":"The Outer Worlds: Murder on Eridanos is the second narrative expansion to the critically acclaimed and award-winning sci-fi RPG from Obsidian Entertainment and Private Division. Venture to the skies of Eridanos and unravel the grandest murder mystery in the Halcyon colony! Everyone is a suspect in this peculiar whodunit after Rizzo’s hired spokesperson, the famous Halcyon Helen, winds up dead ahead of the release of the brand-new Spectrum Brown vodka. Alongside your companions, travel across the floating islands of Eridanos and piece together clues using the Discrepancy Amplifier, a new gadget that highlights otherwise unseen hints. There’s more to this mystery than meets the eye, and it’s up to you (and your crew, if you choose) to solve the case. Key Features: • Murder mystery: Suspicions abound, and it’s up to you to get to the bottom of the murder of Halcyon Helen, the most well-known celebrity in the colony. Use the new Discrepancy Amplifier, your key to solving the case, as it highlights temporal inconsistencies not otherwise seen with the naked eye. • A unique world: Travel among the floating islands of Eridanos, from the luxurious confines of the Grand Colonial Hotel to Rizzo’s colorful groves. But be careful about the smiling employees you encounter, as there’s something dark lingering under the bright and cheerful surface. • New weapons and character customization: Three new science weapons can be added to the player’s arsenal alongside weapon and armor variants to use while solving the case. And increase your level cap by three and employ new perks and flaws to create your most unique character yet. The Outer Worlds: Murder on Eridanos is the second and final story expansion that can be purchased individually or bundled at a discount in The Outer Worlds Expansion Pass. Please be careful not to make duplicate purchases. A copy of The Outer Worlds on the same platform is required to play expansion(s).","SaleStarted":"2023-02-19","LowestPrice":"/game/81131","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202102/2319/ZZ0YsUkgK3GjK7hu0YK49JS8.png?w=200","MainStory":5,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP4829-CUSA13689_00-OUTERWORLDSDLC02","Trailer":"https://www.youtube.com/watch?v=5lYdBs5rGkw","PercentOff":"35%","Completionist":11,"genre":"Action, Role Playing Games, Unique","PlusPrice":93.6,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202102/2319/ZZ0YsUkgK3GjK7hu0YK49JS8.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-4/the-outer-worlds-murder-on-eridanos","Title":"The Outer Worlds: Murder on Eridanos","ESRBRating":"TRD","Publisher":"TAKE-TWO INTERACTIVE SOFTWARE UK","ReleaseDate":"2021-03-17","Slug":"the-outer-worlds-murder-on-eridanos-playstation-tr","NumberofPlayers":"https://shope.ee/9KAqW7eIpl","IsPS5":0,"Price":144,"MainExtra":8,"SalePrice":93.6,"IsPS4":1},{"SCORE":"56","SaleEnds":"2023-03-06","description":"Includes both PlayStation®4 and PlayStation®5 digital versions of New Tales from the Borderlands**. Within the perpetually war-torn metropolis of Promethea, you'll control Anu, Octavio, and Fran on the worst day of their lives. Help these three lovable losers as they endeavor to change the world (and maybe even save it)! It's time to fight back against exploitation and corporate greed. It's time to make Mayhem your business. THE UNDERDOG STORY OF THREE LOVABLE NOBODIES Decide the fates of altruistic scientist Anu, her ambitious, \"\"streetwise\"\" brother Octavio, and the fierce, frogurt-slinging Fran. With nothing left to lose and everything to gain, you'll claw and con your way through this thrilling five-part story full of gun-toting goons, otherworldly beasts, and delicious tacos. AN EXTRAORDINARY CINEMATIC ADVENTURE The Borderlands aren't just home to Vault Hunters, psychos, and weapons-corp CEOs—they're full of downtrodden, intrepid civilians just trying to get by. With a host of returning and fresh faces, including an assassin bot with comedic aspirations and a less-murderous-than-usual bandit, this unforgettable tale is sure to delight fans new and old. YOUR CHOICES SHAPE THE OUTCOME The decisions you make determine how your story ends. Whether it's Anu's vision of a universe that markets more than weapons, Octavio's dreams of fame and fortune, or Fran's frosty plot for revenge—their success or failure depends on you. **No cross-gen progression of save data. Both games are entitled to the same PlayStation® Network account.","SaleStarted":"2023-02-19","LowestPrice":"/game/112461","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202208/0923/1V5tQzT1HqcR9c02SO0o2PJK.png?w=200","MainStory":9,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-PPSA03500_00-000CYPRESS2EUPS5","Trailer":"https://www.youtube.com/watch?v=8688wNaRnD0","PercentOff":"50%","Completionist":15,"genre":"Adventure, Casual","PlusPrice":249.5,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202208/0923/1V5tQzT1HqcR9c02SO0o2PJK.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-5/new-tales-from-the-borderlands","Title":"New Tales from the Borderlands","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-10-20","Slug":"new-tales-from-the-borderlands-playstation-tr","NumberofPlayers":"https://shope.ee/10ViahPR2n","IsPS5":1,"Price":499,"MainExtra":11,"SalePrice":249.5,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"It's time to take your game from the court to the course - grab two amazing games at a winning price! NBA 2K23 Digital Deluxe Edition Rise to the occasion and realize your full potential in NBA 2K23. Prove yourself against the best players in the world and showcase your talent in MyCAREER or The W. Pair today’s All-Stars with timeless legends in MyTEAM. Build a dynasty of your own as a GM, or lead the league in a new direction as the Commissioner in MyNBA. Take on NBA or WNBA teams in PLAY NOW and experience true-to-life gameplay. Make your name in The City, the most expansive online basketball world yet (for PS5™), or embark on a swashbuckling basketball journey (for PS4™) aboard the cruise ship. No matter the journey, be ready to call next alongside the best ballers in the biggest basketball community. Ball without limits as you collect and assemble a bevy of legendary talent from any era in MyTEAM. Dominate the hardwood each Season, and bring your vision to life with a broad set of customization tools to create the perfect look for your perfect starting five. This edition includes: •NBA 2K23 for PS4™ and PS5™ •10K MyTEAM Points •10 MyTEAM Tokens •Sapphire Devin Booker & Ruby Michael Jordan MyTEAM Cards •23 MyTEAM Promo Packs (Receive 10 at launch plus a topper pack, then 2 per week for 6 weeks) •Free Agent Option Pack •Diamond Jordan Shoe Card •Ruby Coach Card Pack •10 Boosts for each MyCAREER Skill Boost type & each Gatorade Boost type •4 Cover Athlete T-Shirts for your MyPLAYER •MyPLAYER backpack and arm sleeve •Custom-design skateboard for MyPLAYER •One 2-Hr Double XP Coin PGA TOUR 2K23 Cross-Gen Edition Take your skills on the PGA TOUR and become the next FedExCup Champion as you compete against TOUR pros and establish new rivalries. For the first time, play as male and female pros including Tiger Woods, in online and local play. Also features licensed courses such as East Lake Golf Club, TPC Sawgrass, TPC Scottsdale, and more. Create your own dream course with the Course Designer, which features thousands of customizable objects and cross-platform sharing. Level up your MyPLAYER with new Skills and Archetypes and bring the swag to the green with new licensed gear and apparel. Plus, run your own online societies to manage tournaments and seasons or test your skills against your friends in Divot Derby and Casual mode.","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202212/0221/074NsfVUA992daT9Gc8TrlXC.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-CUSA33075_00-NBAPGABUNDLE0000","Trailer":"","PercentOff":"65%","Completionist":"","genre":"Sports","PlusPrice":384.65,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202212/0221/074NsfVUA992daT9Gc8TrlXC.png","OpenCriticURL":"","Title":"PGA TOUR 2K23 x NBA 2K23 Bundle","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-12-13","Slug":"pga-tour-2k23-x-nba-2k23-bundle-playstation-tr","IsPS5":1,"Price":1099,"MainExtra":"","SalePrice":384.65,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"This pack includes: • Red polo • Black pants • Black hat • TW golf shoes • TW golf belt • Tiger Bridgestone branded golf balls *Red Nike Polo, Black Nike Pants, TW Golf Belt cosmetic items from the Tiger Woods Signature Sunday Pack are not available for use with female MyPLAYERs.","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202210/0103/UTXcKdtkxSiDhw85RU1BeRcg.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-PPSA04426_00-TIGERSIGPAKBUNDL","Trailer":"","PercentOff":"25%","Completionist":"","genre":"Sports","PlusPrice":111.75,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202210/0103/UTXcKdtkxSiDhw85RU1BeRcg.png","OpenCriticURL":"","Title":"PGA TOUR 2K23 Tiger Woods Signature Sunday Pack","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-10-14","Slug":"pga-tour-2k23-tiger-woods-signature-sunday-pack-playstation-tr","IsPS5":1,"Price":149,"MainExtra":"","SalePrice":111.75,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"Welcome to PGA TOUR 2K23! This edition includes the Standard Edition and dual-gen entitlement plus: • Golden Club Pack: Golden driver, golden putter, and 4 Uncommon tier golf ball sleeves Take your skills on the PGA TOUR and become the next FedExCup Champion as you compete against TOUR pros and establish new rivalries. For the first time, play as male and female pros including Tiger Woods, in online and local play. Also features licensed courses such as East Lake Golf Club, TPC Sawgrass, TPC Scottsdale, and more. Create your own dream course with the Course Designer, which features thousands of customizable objects and cross-platform sharing. Introducing Topgolf with competitive 1-4 player local and online play, bringing the range’s excitement and fun to both casual and seasoned players. Level up your MyPLAYER with new Skills and Archetypes and bring the swag to the green with new licensed gear and apparel. Plus, run your own online societies to manage tournaments and seasons or test your skills against your friends in Divot Derby and Casual mode.","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202207/2201/rhZ9AU0lZ221Km5tlnGcbTaG.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-PPSA04426_00-PGATOUR2K23CRSGN","Trailer":"","PercentOff":"50%","Completionist":"","genre":"Sports","PlusPrice":424.5,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202207/2201/rhZ9AU0lZ221Km5tlnGcbTaG.png","OpenCriticURL":"","Title":"PGA 2K23 Cross-Gen Edition","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-10-13","Slug":"pga-2k23-crossgen-edition-playstation-tr","IsPS5":1,"Price":849,"MainExtra":"","SalePrice":424.5,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"Welcome to PGA TOUR 2K23! Take your skills on the PGA TOUR and become the next FedExCup Champion as you compete against TOUR pros and establish new rivalries. For the first time, play as male and female pros including Tiger Woods, in online and local play. Also features licensed courses such as East Lake Golf Club, TPC Sawgrass, TPC Scottsdale, and more. Create your own dream course with the Course Designer, which features thousands of customizable objects and cross-platform sharing. Introducing Topgolf with competitive 1-4 player local and online play, bringing the range’s excitement and fun to both casual and seasoned players. Level up your MyPLAYER with new Skills and Archetypes and bring the swag to the green with new licensed gear and apparel. Plus, run your own online societies to manage tournaments and seasons or test your skills against your friends in Divot Derby and Casual mode.","SaleStarted":"2023-02-19","LowestPrice":"/game/114785","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202207/2201/rhZ9AU0lZ221Km5tlnGcbTaG.png?w=200","MainStory":16,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-CUSA29107_00-00000PGATOUR2K23","Trailer":"https://www.youtube.com/watch?v=YDcdmAGi-qc","PercentOff":"50%","Completionist":32,"genre":"Sports","PlusPrice":399.5,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202207/2201/rhZ9AU0lZ221Km5tlnGcbTaG.png","OpenCriticURL":"","Title":"PGA TOUR 2K23","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-10-13","Slug":"pga-tour-2k23-playstation-tr","IsPS5":0,"Price":799,"MainExtra":0,"SalePrice":399.5,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"Hit the links with more swagger in PGA TOUR 2K23. Now featuring playable male and female pros, including Tiger Woods, new licensed courses, more control options, an authentic PGA TOUR MyCAREER, Course Designer, and new MyPLAYER Skills and Archetypes! The Tiger Woods Edition includes dual-gen entitlement, plus: • Michael Jordan Bonus Pack: Playable Michael Jordan, and 4 Common tier golf ball sleeves • Deluxe Edition Bonus Pack: 1300 VC, hockey stick putter, gold baseball cap, gold golf glove, and 3 Rare tier golf ball sleeves • Golden Club Pack: Golden driver, golden putter, and 4 Uncommon tier golf ball sleeves • Tiger Woods Edition Bonus Pack: Tiger Woods TaylorMade wedge set, TW t-shirt, 3 Epic tier golf ball sleeves • Tiger Woods Signature Sunday Pack: Red polo, black pants, black hat, TW golf shoes, TW golf belt, and Tiger Bridgestone branded golf balls PGA TOUR 2K23. More Golf. More Game. *Red Nike Polo, Black Nike Pants, TW Golf Belt cosmetic items from the Tiger Woods Signature Sunday Pack are not available for use with female MyPLAYERs.","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202208/0822/FHJlGECHcFiWbQnsJGcHNuv3.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-PPSA04426_00-PGATOUR2K23TWED0","Trailer":"","PercentOff":"30%","Completionist":"","genre":"Sports","PlusPrice":909.3,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202208/0822/FHJlGECHcFiWbQnsJGcHNuv3.png","OpenCriticURL":"","Title":"PGA TOUR 2K23 Tiger Woods Edition","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-10-13","Slug":"pga-tour-2k23-tiger-woods-edition-playstation-tr","IsPS5":1,"Price":1299,"MainExtra":"","SalePrice":909.3,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"Rise to the occasion and realize your full potential in NBA 2K23. Prove yourself against the best players in the world and showcase your talent in MyCAREER. Pair today’s All-Stars with timeless legends in MyTEAM. Build a dynasty of your own in MyGM or take the NBA in a new direction with MyLEAGUE. Take on NBA or WNBA teams in PLAY NOW and experience true-to-life gameplay. How will you Answer the Call? TAKE MORE CONTROL Feel refined gameplay in the palm of your hands on both sides of the ball in NBA 2K23. Attack the basket with a new arsenal of offensive skill-based moves, while you unleash your potential as a lockdown defender with new 1-on-1 mechanics to stifle opposing players at every turn. AN EPIC VOYAGE AWAITS Embark on a swashbuckling basketball journey aboard a spacious cruiseliner equipped with pristine courts, scenic views, and a boatload of rewards for you and your MyPLAYER to enjoy. Plus, there’s even more to explore during shore excursions. JORDAN CHALLENGE RETURNS Step back in time with era-specific visuals that captured Michael Jordan’s ascent from collegiate sensation to global icon with immersive Jordan Challenges chronicling his career-defining dominance. Lace up his shoes to recreate his otherworldly stat lines and iconic last shots, while listening to first-hand accounts from those who witnessed his maturation from budding star to basketball legend. BUILD YOUR SQUAD Ball without limits as you collect and assemble a bevy of legendary talent from any era in MyTEAM. Dominate the hardwood each Season, and bring your vision to life with a broad set of customization tools to create the perfect look for your perfect starting five.","SaleStarted":"2023-02-19","LowestPrice":"/game/110880","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202206/2200/vLdTCoRLhhHmAAqRypgAOlAI.png?w=200","MainStory":11,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-CUSA33075_00-NBA2K23000000000","Trailer":"https://www.youtube.com/watch?v=RxLS5Tgo9YM","PercentOff":"75%","Completionist":0,"genre":"Sports","PlusPrice":999999,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202206/2200/vLdTCoRLhhHmAAqRypgAOlAI.png","OpenCriticURL":"","Title":"NBA 2K23 for PS4™","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-09-08","Slug":"nba-2k23-for-ps4-playstation-tr","IsPS5":0,"Price":799,"MainExtra":0,"SalePrice":199.75,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"Rise to the occasion in NBA 2K23. Showcase your talent in MyCAREER or The W. Pair All-Stars with timeless legends in MyTEAM. Build a dynasty of your own as a GM, or lead the league in a new direction as the Commissioner in MyNBA. Take on NBA or WNBA teams in PLAY NOW and experience true-to-life gameplay. • Make your name in The City, the most expansive online basketball world yet (for PS5™), or embark on a swashbuckling basketball journey (for PS4™) aboard the cruise ship. No matter the journey, be ready to call next alongside the best ballers in the biggest basketball community. • Step back in time with era-specific visuals that captured Michael Jordan’s ascent from collegiate sensation to global icon with immersive Jordan Challenges chronicling his career-defining dominance. Lace up his shoes to recreate his otherworldly stat lines and iconic last shots, while listening to first-hand accounts from those who witnessed his maturation from budding star to basketball legend. • Ball without limits as you collect and assemble a bevy of legendary talent from any era in MyTEAM. Dominate the hardwood each Season, and bring your vision to life with a broad set of customization tools to create the perfect look for your perfect starting five. This edition includes: NBA 2K23 for PS4™ & PS5™ 100K VC 10K MyTEAM Points 10 MyTEAM Tokens Sapphire Devin Booker & Ruby Michael Jordan MyTEAM Cards 23 MyTEAM Promo Packs (Receive 10 at launch plus a topper pack, then 2 per week for 6 weeks) Free Agent Option Pack Diamond Jordan Shoe Card Ruby Coach Card Pack 10 Boosts for each MyCAREER Skill Boost type & each Gatorade Boost type 4 Cover Athlete T-Shirts for your MyPLAYER MyPLAYER backpack and arm sleeve Custom-design skateboard for MyPLAYER 1 2-Hr Double XP Coin","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202207/0817/R1khsvIUkSz1mf3pL1Mv1q9B.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-PPSA07170_00-NBA2K23MCHLJRDN0","Trailer":"","PercentOff":"60%","Completionist":"","genre":"Sports","PlusPrice":439.6,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202207/0817/R1khsvIUkSz1mf3pL1Mv1q9B.png","OpenCriticURL":"","Title":"NBA 2K23 Michael Jordan Edition","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-09-08","Slug":"nba-2k23-michael-jordan-edition-playstation-tr","IsPS5":1,"Price":1099,"MainExtra":"","SalePrice":439.6,"IsPS4":1},{"SCORE":"","SaleEnds":"1990-01-01","description":"As the sun sets on the last day of summer camp, the counselors of Hackett’s Quarry throw a party to celebrate. Things quickly take a turn for the worse. Hunted by blood-drenched locals and something far more sinister, the teens' party plans unravel into an unpredictable night of horror. Play as each of the nine counselors in a thrilling cinematic tale, where every decision shapes your story. YOUR STORY, THEIR FATE Will you save your friends or run for your life? Every choice, big or small, shapes your story and determines who lives to tell the tale. A STUNNING CINEMATIC EXPERIENCE Cutting edge facial capture and filmic lighting techniques, combined with incredible performances from an iconic cast of Hollywood talent, bring the horrors of Hackett’s Quarry to life. ENJOY THE FRIGHT WITH FRIENDS Play with up to 7 friends online*, where invited players watch along and vote on key decisions, creating a story shaped by the whole group! Or, play together in a party horror couch co-op experience where each player controls a counselor. CUSTOMIZE YOUR EXPERIENCE Adjustable difficulty lets players of any skill level enjoy the horror, while Movie Mode lets you enjoy The Quarry as a binge-worthy cinematic thriller. STARRING: David Arquette as Chris Ariel Winter as Abigail Brenda Song as Kaitlyn Evan Evagora as Nick Halston Sage as Emma Justice Smith as Ryan Miles Robbins as Dylan Siobhan Williams as Laura Skyler Gisondo as Max Zach Tinker as Jacob Ethan Suplee as Bobby Grace Zabriskie as Eliza Lance Henriksen as Jedediah Lin Shaye as Constance Ted Raimi as Travis * Online multiplayer functionality will be available post-launch on or by July 8, 2022. Multiplayer functionality across same generation only.","SaleStarted":"1989-12-17","LowestPrice":"/game/105741","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202203/0501/FUr3M0kGxyddUfUeuKBBFf2w.png?w=200","MainStory":9,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-CUSA31820_00-1347595747547132","Trailer":"https://www.youtube.com/watch?v=Zh2K7SxRHmo","PercentOff":"50%","Completionist":30,"genre":"Horror","PlusPrice":299.5,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202203/0501/FUr3M0kGxyddUfUeuKBBFf2w.png","OpenCriticURL":"","Title":"The Quarry for PS4™","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-06-09","Slug":"the-quarry-for-ps4-playstation-tr","IsPS5":0,"Price":599,"MainExtra":10,"SalePrice":299.5,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"Embark on an epic adventure full of whimsy, wonder, and high-powered weaponry! Bullets, magic, and broadswords collide across this chaotic fantasy world brought to life by the unpredictable Tiny Tina. Roll your own multiclass hero and loot, shoot, slash, and cast your way through outlandish monsters and loot-filled dungeons on a quest to stop the tyrannical Dragon Lord. Everyone's welcome, so join the party, throw on your adventuring boots, and be Chaotic Great! This Edition Includes: -Full Game -Optimized for PlayStation®5 console -Dragon Lord Pack -Season Pass AN UNPREDICTABLE FANTASY WORLD Tiny Tina is your disorderly guide through an extraordinary tabletop realm where rules rarely apply. Explore a vast overworld spanning majestic cities, dank mushroom forests, foreboding fortresses, and more! GUNS, SPELLS, AND MORE Blast baddies with powerful guns and devastating spells in frenetic first-person battles. Use your firepower to vanquish legions of enemies, including smack-talking skeletons, land-roaming sharks, and colossal bosses. Then delve deeper into dangerous dungeons for a shot at epic loot! PARTY UP TO DEFEAT EVIL Joining you at the table are headstrong captain Valentine and rule-obsessed robot Frette. During your quest to defeat the Dragon Lord, you'll meet a cast of lovable misfits like a lute-wielding Bardbarian and your very own Fairy Punchfather. PERSONALIZE YOUR HERO Create the perfect hero with deep customization, including a multiclass system that lets you mix and match six unique character skill trees, all with their own awesome abilities. Level up, refine your build, expand your arsenal, and become the ultimate adventurer. BAND TOGETHER IN CHAOTIC CO-OP Enjoy the story solo or start a party with up to three friends in seamless online multiplayer or local split-screen. Share the spoils or rush to get the shiniest loot—how you play is up to you!","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202108/0510/l2drT3RrN02RDR3W4lWdvYXi.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-PPSA01493_00-TTWPREMIUMSIEE00","Trailer":"","PercentOff":"50%","Completionist":"","genre":"Shooter","PlusPrice":319.5,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202108/0510/l2drT3RrN02RDR3W4lWdvYXi.png","OpenCriticURL":"","Title":"Tiny Tina's Wonderlands: Chaotic Great Edition","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-03-24","Slug":"tiny-tinas-wonderlands-chaotic-great-edition-playstation-tr","IsPS5":1,"Price":639,"MainExtra":"","SalePrice":319.5,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"Embark on an epic adventure full of whimsy, wonder, and high-powered weaponry! Bullets, magic, and broadswords collide across this chaotic fantasy world brought to life by the unpredictable Tiny Tina. Roll your own multiclass hero and loot, shoot, slash, and cast your way through outlandish monsters and loot-filled dungeons on a quest to stop the tyrannical Dragon Lord. Everyone's welcome, so join the party, throw on your adventuring boots, and be Chaotic Great! AN UNPREDICTABLE FANTASY WORLD Tiny Tina is your disorderly guide through an extraordinary tabletop realm where rules rarely apply. Explore a vast overworld spanning majestic cities, dank mushroom forests, foreboding fortresses, and more! GUNS, SPELLS, AND MORE Blast baddies with powerful guns and devastating spells in frenetic first-person battles. Use your firepower to vanquish legions of enemies, including smack-talking skeletons, land-roaming sharks, and colossal bosses. Then delve deeper into dangerous dungeons for a shot at epic loot! PARTY UP TO DEFEAT EVIL Joining you at the table are headstrong captain Valentine and rule-obsessed robot Frette. During your quest to defeat the Dragon Lord, you'll meet a cast of lovable misfits like a lute-wielding Bardbarian and your very own Fairy Punchfather. PERSONALIZE YOUR HERO Create the perfect hero with deep customization, including a multiclass system that lets you mix and match six unique character skill trees, all with their own awesome abilities. Level up, refine your build, expand your arsenal, and become the ultimate adventurer. BAND TOGETHER IN CHAOTIC CO-OP Enjoy the story solo or start a party with up to three friends in seamless online multiplayer or local split-screen. Share the spoils or rush to get the shiniest loot—how you play is up to you!","SaleStarted":"2023-02-19","LowestPrice":"/game/93455","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202203/0417/JRA5xAmPvVwd0p5ies4MHfRJ.png?w=200","MainStory":16,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-CUSA23767_00-0SIEEPS4DAFFODIL","Trailer":"https://www.youtube.com/watch?v=EeW929M1KT0","PercentOff":"50%","Completionist":42,"genre":"Shooter","PlusPrice":999999,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202203/0417/JRA5xAmPvVwd0p5ies4MHfRJ.png","OpenCriticURL":"","Title":"Tiny Tina's Wonderlands for PS4™","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-03-24","Slug":"tiny-tinas-wonderlands-for-ps4-playstation-tr","IsPS5":0,"Price":599,"MainExtra":26,"SalePrice":299.5,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"Take on outlandish new challenges with the Tiny Tina's Wonderlands Season Pass! Delve into four distinct dungeons and battle formidable bosses within. Discover all-new weapons and gear, wield the power of an additional seventh class included with the fourth dungeon, and rock the cosmetics of the Butt Stallion Pack! On the outskirts of Brighthoof lies the eerie Dreamveil Overlook, where the enigmatic, affable fortune teller Vesper awaits an audience. Peer into her Mirrors of Mystery and you'll be whisked away to illusionary environments with fearsome new boss encounters, fighting for your life as Vesper regales you with fantastical fables. Each time you successfully vanquish the boss' increasingly powerful forms, you'll earn Lost Souls that let you spin Vesper's Wheel of Fate, rewarding you with Legendary weapons and gear, as well as unique cosmetics. Completing a story also adds its contents to the pool of possibilities in the Chaos Chamber, the endlessly replayable endgame of Tiny Tina's Wonderlands! - Fight your way through four replayable dungeons, guided by the mysterious Vesper - Create even more Multiclass combinations with an additional seventh class, complete with two fresh Action Skills and a unique skill tree - Test your skills against new boss encounters with scaling difficulty and optional challenges - Collect a bevy of new Legendary weapons, gear, and cosmetic items - Expand the pool of randomized content and rewards in the Chaos Chamber endgame mode - Flaunt the cosmetics included in the Butt Stallion Pack: - Diamond Guard Armor Presets (3 items) - Crystal Glitter Makeup Pack (5 items) - Adamant Throne Banner Set (2 items) - Diamond Hero Statue Material","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202203/2417/svHCLM7lG4eoU3omaFylLwqW.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-CUSA23767_00-TTWSEASONPASSIEE","Trailer":"","PercentOff":"35%","Completionist":"","genre":"Shooter","PlusPrice":142.35,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202203/2417/svHCLM7lG4eoU3omaFylLwqW.png","OpenCriticURL":"","Title":"Tiny Tina's Wonderlands: Season Pass","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2022-03-24","Slug":"tiny-tinas-wonderlands-season-pass-playstation-tr","IsPS5":1,"Price":219,"MainExtra":"","SalePrice":142.35,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"Purchase the Megalodon Shark Cash Card (PS5™) to gain GTA$10,000,000 to spend in the PS5™ version of GTA Online. Cash is king in this town. Solve your money problems and help get what you want across Los Santos and Blaine County with the purchase of cash packs for Grand Theft Auto Online. All purchased cash is automatically deposited into your character’s bank account. Spend wisely, cash therapy is fleeting.","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202211/3014/02fdzuH7Le5BqAkpgxq9bigV.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1004-PPSA01721_00-GTAVPS5CASHPACK6","Trailer":"","PercentOff":"15%","Completionist":"","genre":"Action, Adventure","PlusPrice":458.15,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202211/3014/02fdzuH7Le5BqAkpgxq9bigV.png","OpenCriticURL":"","Title":"GTA Online: Megalodon Shark Cash Card (PS5™)","ESRBRating":"TRD","Publisher":"Rockstar Games","ReleaseDate":"2022-03-14","Slug":"gta-online-megalodon-shark-cash-card-ps5-playstation-tr","IsPS5":1,"Price":539,"MainExtra":"","SalePrice":458.15,"IsPS4":0},{"SCORE":"","SaleEnds":"2023-03-06","description":"OlliOlli World’s Expansion Pass includes two expansions to the game bundled at a discount. Advance your quest for Gnarvana as you master fresh gameplay mechanics, explore new biomes, and meet wacky characters. Continue the journey to find your flow through the critically acclaimed game OlliOlli World with the Expansion Pass. ● OlliOlli World: VOID Riders. Extra steezy extraterrestrials are intent on acquiring Radlandian skate specimens for their leader, Nebulord. VOID Riders brings a brave new world of challenge and space-age gear as you prepare to enter the alien home-planet: the V.O.I.D. Available Now. ● OlliOlli World: Finding the Flowzone. Glide and grind above the clouds as you ride the winds to the lost skate-cropolis in the sky: Radlantis. Journey through the five Flowzone Layer regions: from the cotton candy clouds of Cirrus through the lucid midnight woods of Cumulus on your quest to the lost city in OlliOlli World's final DLC! Available Now. ● \"Close Encounter Skate Deck” OlliOlli World base game is required to play expansions. Please be careful not to make duplicate purchases.","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202201/2815/FHKxfM1N6MtaydUQbRpQLI4R.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP4829-CUSA25466_00-OLLIOLLIWORLDEXP","Trailer":"","PercentOff":"20%","Completionist":"","genre":"Action, Arcade, Sport","PlusPrice":119.2,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202201/2815/FHKxfM1N6MtaydUQbRpQLI4R.png","OpenCriticURL":"","Title":"OlliOlli World Expansion Pass (PS4/PS5)","ESRBRating":"TRD","Publisher":"TAKE-TWO INTERACTIVE SOFTWARE UK","ReleaseDate":"2022-02-07","Slug":"olliolli-world-expansion-pass-ps4ps5-playstation-tr","IsPS5":1,"Price":149,"MainExtra":"","SalePrice":119.2,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"Three iconic cities, three epic stories. Play the genre-defining classics of the original Grand Theft Auto Trilogy: Grand Theft Auto III, Grand Theft Auto: Vice City and Grand Theft Auto: San Andreas updated for a new generation, now with across-the-board enhancements including brilliant new lighting and environmental upgrades, high-resolution textures, increased draw distances, Grand Theft Auto V-style controls and targeting, and much more, bringing these beloved worlds to life with all new levels of detail. Grand Theft Auto: The Trilogy – The Definitive Edition includes: • Grand Theft Auto III: It all starts in Liberty City. With the revolutionary freedom to go anywhere and jack anyone, Grand Theft Auto III puts the center of the criminal underworld at your fingertips, if you have enough guts to take it. • Grand Theft Auto: Vice City: Welcome to the 1980s. From the decade of big hair and pastel suits comes the story of one man's rise to the top of the criminal pile. Grand Theft Auto returns with Tommy Vercetti’s tale of betrayal and revenge in a neon-soaked tropical town full of excess and brimming with possibilities. • Grand Theft Auto: San Andreas: Five years ago, Carl ‘CJ’ Johnson escaped the haze of Los Santos, San Andreas...a city tearing itself apart with gang trouble, drugs, and corruption. Now, it's the early 90s. CJ’s got to go home - his mother has been murdered, his family has fallen apart, and his childhood friends are all heading towards disaster. On his return to the neighborhood, a couple of cops frame him for homicide, forcing CJ on a journey that takes him across the entire state of San Andreas, to save his family and to take control of the streets in the next iteration of the series that changed everything. Developed by Rockstar Games, adapted by Grove Street Games.","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202110/0106/9EfOgkd9XN01Hzre1v61y27z.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1004-PPSA05805_00-GTATRILOGYBUNDLE","Trailer":"https://www.youtube.com/watch?v=7x7zr1onxfU","PercentOff":"50%","Completionist":"","genre":"Action","PlusPrice":264.5,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202110/0106/9EfOgkd9XN01Hzre1v61y27z.png","OpenCriticURL":"","Title":"Grand Theft Auto: The Trilogy – The Definitive Edition (PS5 & PS4)","ESRBRating":"TRD","Publisher":"Rockstar Games","ReleaseDate":"2021-11-10","Slug":"grand-theft-auto-the-trilogy--the-definitive-edition-ps5--ps4-playstation-tr","IsPS5":1,"Price":529,"MainExtra":"","SalePrice":264.5,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"Get two seasons' worth of Borderlands 3's premium add-on content in one glorious package with the Season Pass Bundle! Make more mayhem with additional story campaigns, a challenging raid boss, an extra skill tree for each Vault Hunter, kickin' cosmetic items, and more! Contains all content from Borderlands 3's Season Pass and Season Pass 2, including: Moxxi's Heist of The Handsome Jackpot Join Moxxi's crew of ragtag \"experts\" and battle your way through Hyperion security forces and crazed casino-goers to claim The Handsome Jackpot's vault of loot for yourself. Guns, Love, and Tentacles: The Marriage of Wainwright & Hammerlock Fight back against forces of otherworldly evil on the ice planet of Xylourgos alongside former-Vault-Hunter-turned-wedding-planner Gaige and her robot BFF Deathtrap. Bounty of Blood Visit the brutal frontier planet of Gehenna to collect a bounty on The Devil Riders, a violent gang of beast-riding mercenaries, in this gritty tale told by an unseen narrator. Psycho Krieg and the Fantastic Fustercluck Explore the chaotic mind of the heroic psycho Krieg, helping both sides of his dual psyche by blasting his inner demons to bits and braving his imagination's twisted mindscapes. Designer's Cut Get loot or die trying in Arms Race mode and wield the power of an additional skill tree for each Vault Hunter, complete with fresh Action Skills and potent passive abilities. Director's Cut Take on a gargantuan raid boss, solve an interplanetary murder mystery, gear up with three Vault Cards, and delve into behind-the-scenes content. Butt Stallion Pack Celebrate everyone's favorite diamond pony with a weapon skin, trinket, and grenade mod! Multiverse Final Form & Disciples of the Vault Cosmetic Packs See what BL3's heroes would've looked like if they never became Vault Hunters or joined the Children of the Vault!","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202110/1322/V0S9TxuE8Kld6YELodUgX8Dy.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-PPSA01463_00-OAKULTEDDLCBUNDL","Trailer":"","PercentOff":"60%","Completionist":"","genre":"Shooter, Action","PlusPrice":215.6,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202110/1322/V0S9TxuE8Kld6YELodUgX8Dy.png","OpenCriticURL":"","Title":"Borderlands 3 Season Pass Bundle","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2021-10-24","Slug":"borderlands-3-season-pass-bundle-playstation-tr","IsPS5":1,"Price":539,"MainExtra":"","SalePrice":215.6,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"This is the complete collection* of all available DLC and is intended for people who already have Civilization VI, but do not yet own any of the DLC. Civilization VI is required to access DLC. MAKE HISTORY in one of the most critically acclaimed and influential game franchises in strategy game history. Choose a leader and pursue agendas inspired by their real-life counterparts. Explore new land, research technology, and go head-to-head with historical leaders as you lead your civilization from rocks to rockets. Cities expand physically across the map, create new strategic possibilities through the game as you pursue multiple ways to achieve victory and build an empire to stand the test of time. The Civilization VI Anthology Upgrade Bundle includes six DLC packs, the expansions Rise and Fall and Gathering Storm, and the full New Frontier Pass. • CIVILIZATION VI: RISE AND FALL: Experience new game mechanics including Great Ages and Governors, upgrades to the Diplomacy and Government systems, and an additional 8 civilizations, 9 leaders, and several units, districts, wonders, and buildings. • CIVILIZATION VI: GATHERING STORM: Explore an active planet in an expansion that introduces climate changes for the first time in series history. Contend with natural disasters and other new Environmental Effects, complete great Engineering Projects, and manage electrical power. New features including a World Congress, new Diplomatic Victory condition, and an all-new era added to the Technology and Civics tree. Also includes new civilizations, leaders, units, and buildings. • NEW FRONTIER PASS: Introducing 6 new game modes, recruitable heroes from history and myth, 8 new civilizations and 9 leaders, dialed-up natural disasters in Apocalypse Mode, and the addition of secret societies that can enhance or undermine your empire. *The Red Death playable scenario released on PC isn’t available on consoles.","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202107/0123/PzaoIXaAq4bPMZXliAc3fby4.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-CUSA15381_00-CIV6ANTHLGYUPGDE","Trailer":"","PercentOff":"60%","Completionist":"","genre":"Strategy, Role Playing Games, Unique","PlusPrice":175.6,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202107/0123/PzaoIXaAq4bPMZXliAc3fby4.png","OpenCriticURL":"","Title":"Sid Meier’s Civilization® VI Anthology Upgrade Bundle","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2021-07-13","Slug":"sid-meiers-civilization-vi-anthology-upgrade-bundle-playstation-tr","IsPS5":0,"Price":439,"MainExtra":"","SalePrice":175.6,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"This product entitles you to download both the digital PS4™ version and the digital PS5™ version of this game. PlayStation®4 copies of Borderlands 3 include a digital upgrade to the fully optimized for PlayStation®5 version! Experience the game in gorgeous 4K resolution at up to 60 fps in single-player and online co-op. Add more couch co-op mayhem with expanded local splitscreen support for up to 4 players. The Super Deluxe Edition includes the Season Pass and Deluxe bonus content. Season Pass: • 4 campaign DLC packs featuring new stories, missions and challenges • Butt Stallion weapon skin, weapon trinket, and grenade mod Deluxe bonus content: • Retro Cosmetic Pack • Neon Cosmetic Pack • Gearbox Cosmetic Pack • Toy Box Weapons Pack • Equippable XP & Loot Drop Boost Mods The original shooter-looter returns, packing bazillions of guns and an all-new mayhem-fueled adventure! Blast through new worlds and enemies as one of four brand new Vault Hunters – the ultimate treasure-seeking badasses of the Borderlands, each with deep skill trees, abilities and customization. Play solo or with friends to take on insane enemies, score loads of loot and save your home from the most ruthless cult leaders in the galaxy. If you already own the PS4™ version of this game, you can get the PS5™ digital version at no extra cost and you do not need to purchase this product. Owners of a PS4™ disc copy must insert it into the PS5™ every time they want to download or play the PS5™ digital version. PS4™ game disc owners who buy the PS5™ Digital Edition disc-free console will not be able to get the PS5™ version at no extra cost.","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202010/2322/4hbCDBET2tJsBEszKxO8o33c.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-PPSA01463_00-000000OAKSIEESDD","Trailer":"","PercentOff":"75%","Completionist":"","genre":"Action, Shooter, Shooter","PlusPrice":142.25,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202010/2322/4hbCDBET2tJsBEszKxO8o33c.png","OpenCriticURL":"","Title":"Borderlands 3: Super Deluxe Edition PS4™ &  PS5™","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2020-11-11","Slug":"borderlands-3-super-deluxe-edition-ps4---ps5-playstation-tr","IsPS5":1,"Price":569,"MainExtra":"","SalePrice":142.25,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"Includes main games and DLC releases. Mafia: Definitive Edition Re-made from the ground up, rise through the ranks of the mafia during the Prohibition-era. After an inadvertent brush with the mob, Tommy Angelo is reluctantly thrust into the world of organized crime. Initially uneasy about falling in with the Salieri family, the rewards become too big to ignore. Mafia II: Definitive Edition Remastered in HD, live the life of a gangster during the Golden-era of organized crime. War hero Vito Scaletta becomes entangled with the mob in hopes of paying his father’s debts. Alongside his buddy Joe, Vito works to prove himself, climbing the family ladder with crimes of larger reward, status and consequence. Mafia III: Definitive Edition After years of combat in Vietnam, Lincoln Clay’s surrogate family, the black mob, is betrayed and killed by the Italian Mafia. Lincoln builds a new family on the ashes of the old, blazing a path of revenge through the Mafioso responsible.","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202009/0902/7CAOfTFXzgypO4TWHnWtQstC.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1001-CUSA03617_00-MAFIATRILOGYDEFI","Trailer":"","PercentOff":"60%","Completionist":"","genre":"Action, Adventure","PlusPrice":149.6,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202009/0902/7CAOfTFXzgypO4TWHnWtQstC.png","OpenCriticURL":"","Title":"Mafia: Trilogy","ESRBRating":"TRD","Publisher":"2K","ReleaseDate":"2020-09-24","Slug":"mafia-trilogy-playstation-tr","IsPS5":0,"Price":374,"MainExtra":"","SalePrice":149.6,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"The Outer Worlds Expansion Pass includes two story expansions bundled at a discount. Experience mysterious new conflicts, intriguing quests, strange new locations, outlandish weapons, devious characters, and additional ways to aid or defy the Board of Halcyon in two new narrative expansions for the darkly-humorous, critically-acclaimed, and award-winning sci-fi RPG from Obsidian Entertainment and Private Division. • The Outer Worlds: Peril on Gorgon. Investigate the dark secrets of one of the most ambitious scientific undertakings in Halcyon: the development and synthesis of Adrena-Time, a drug intended to improve the productivity of workers across the colony. • The Outer Worlds: Murder on Eridanos. Venture to the skies of Eridanos and unravel the grandest murder mystery in the Halcyon colony! Everyone is a suspect in this peculiar whodunit after Rizzo’s hired spokesperson, the famous Halcyon Helen, winds up dead. A copy of The Outer Worlds on the same platform is required to play expansion pass content. Please be careful not to make duplicate purchases. To download and get access to Murder on Eridanos, please navigate to the Murder on Eridanos PlayStation™ Store page and select “Download”","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202008/1219/JMd535mnKjWS6PY5hwvjOxHo.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP4829-CUSA13689_00-THEOUTERWORLDSXP","Trailer":"","PercentOff":"25%","Completionist":"","genre":"Action, Role Playing Games, Unique","PlusPrice":134.25,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202008/1219/JMd535mnKjWS6PY5hwvjOxHo.png","OpenCriticURL":"","Title":"The Outer Worlds Expansion Pass","ESRBRating":"TRD","Publisher":"TAKE-TWO INTERACTIVE SOFTWARE UK","ReleaseDate":"2020-09-09","Slug":"the-outer-worlds-expansion-pass-playstation-tr","IsPS5":1,"Price":179,"MainExtra":"","SalePrice":134.25,"IsPS4":0},{"SCORE":"","SaleEnds":"2023-03-06","description":"Step into the vibrant, ever-evolving world of Red Dead Online and experience life across frontier America. Forge your own path as you battle lawmen, outlaw gangs and ferocious wild animals to build a life on the American frontier. Build a camp, ride solo or form a posse and explore everything from the snowy mountains in the North to the swamps of the South, from remote outposts to busy farms and bustling towns. Chase down bounties, hunt, fish and trade, search for exotic treasures, run your own underground Moonshine distillery, or become a Naturalist to learn the secrets of the animal kingdom and much more in a world of astounding depth and detail. Join millions of fellow players in the American West, and experience a world now packed with years’ worth of new features, gameplay and additional enhancements. Includes Red Dead Online. Red Dead Redemption 2: Story Mode must be purchased separately.","SaleStarted":"2023-02-19","LowestPrice":"/game/81866","Image":"https://image.api.playstation.com/vulcan/img/rnd/202011/1718/ooOoSjORBdw4VD3KXrHBlhHZ.png?w=200","MainStory":7,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1004-CUSA08519_00-REDEMPTION000002","Trailer":"https://www.youtube.com/watch?v=cWJzdDnrH_M","PercentOff":"50%","Completionist":107,"genre":"Action, Adventure","PlusPrice":94.5,"MexPrice":"https://image.api.playstation.com/vulcan/img/rnd/202011/1718/ooOoSjORBdw4VD3KXrHBlhHZ.png","OpenCriticURL":"","Title":"Red Dead Online","ESRBRating":"TRD","Publisher":"Rockstar Games","ReleaseDate":"2018-10-28","Slug":"red-dead-online-playstation-tr","IsPS5":0,"Price":189,"MainExtra":83,"SalePrice":94.5,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"The Grand Theft Auto V: Premium Edition includes the complete Grand Theft Auto V story experience, free access to the ever evolving Grand Theft Auto Online and all existing gameplay upgrades and content including The Cayo Perico Heist, The Diamond Casino & Resort, The Diamond Casino Heist, Gunrunning and much more. You’ll also get the Criminal Enterprise Starter Pack, the fastest way to jumpstart your criminal empire in Grand Theft Auto Online. GRAND THEFT AUTO V When a young street hustler, a retired bank robber and a terrifying psychopath land themselves in trouble, they must pull off a series of dangerous heists to survive in a city in which they can trust nobody, least of all each other. GRAND THEFT AUTO ONLINE Discover an ever-evolving world of choices and ways to play as you climb the criminal ranks of Los Santos and Blaine County in the ultimate shared Online experience. THE CRIMINAL ENTERPRISE STARTER PACK The Criminal Enterprise Starter Pack is the fastest way for new GTA Online players to jumpstart their criminal empires with the most exciting and popular content plus $1,000,000 bonus cash to spend in GTA Online - all content valued at over GTA$10,000,000 if purchased separately. LAUNCH YOUR CRIMINAL EMPIRE Launch business ventures from your Maze Bank West Executive Office, research powerful weapons technology from your underground Gunrunning Bunker and use your Counterfeit Cash Factory to start a lucrative counterfeiting operation. A FLEET OF POWERFUL VEHICLES Tear through the streets with a range of 10 high performance vehicles including a Supercar, Motorcycles, the weaponized Dune FAV, a Helicopter, a Rally Car and more. You’ll also get properties including a 10 car garage to store your growing fleet. WEAPONS, CLOTHING & TATTOOS You’ll also get access to the Compact Grenade Launcher, Marksman Rifle and Compact Rifle along with Stunt Racing Outfits, Biker Tattoos and more.","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202101/2019/JdvqcPlTYMxXrA1QQJm6TbDX.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1004-CUSA00411_00-PREMIUMPACKOG001","Trailer":"","PercentOff":"40%","Completionist":"","genre":"Action, Adventure","PlusPrice":191.4,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202101/2019/JdvqcPlTYMxXrA1QQJm6TbDX.png","OpenCriticURL":"","Title":"Grand Theft Auto V: Premium Edition","ESRBRating":"TRD","Publisher":"Rockstar Games","ReleaseDate":"2017-12-18","Slug":"grand-theft-auto-v-premium-edition-playstation-tr","IsPS5":0,"Price":319,"MainExtra":"","SalePrice":191.4,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"A dark and violent crime thriller set against the backdrop of 1940’s Los Angeles. Utilizing revolutionary facial animation technology that captures every nuance of an actor's facial performance in astonishing detail, L.A. Noire blends the breathtaking action with true detective work for an unprecedented interactive experience. Solve brutal crimes, plots and conspiracies inspired by real crimes from 1947 Los Angeles, one of the most corrupt and violent times in L.A. history. • Showcased in 1080p for PS4™ and stunning 4K for PS4™ Pro. • Includes the complete original game and all additional downloadable content plus new collectibles and detective suits to unlock, each with unique special abilities. • Features an array of technical and graphical enhancements for a more realistic Los Angeles. Rockstar Games, Inc. ©2006–17. Rockstar Games, LA Noire, and R* are marks/logos/copyrights of Take-Two. Portions (c) Copyright Master Licensing. All rights reserved.","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/cdn/EP1004/CUSA09172_00/oHoljwqVOhZEDFCnDy7G9RiSF3V4srz7.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1004-CUSA09172_00-LANOIRE000000PS4","Trailer":"","PercentOff":"50%","Completionist":"","genre":"Action, Action, Adventure","PlusPrice":84.5,"MexPrice":"https://image.api.playstation.com/cdn/EP1004/CUSA09172_00/oHoljwqVOhZEDFCnDy7G9RiSF3V4srz7.png","OpenCriticURL":"","Title":"L. A. Noire","ESRBRating":"TRD","Publisher":"Rockstar Games","ReleaseDate":"2017-11-13","Slug":"l-a-noire-playstation-tr","IsPS5":0,"Price":169,"MainExtra":"","SalePrice":84.5,"IsPS4":1},{"SCORE":"","SaleEnds":"2023-03-06","description":"Purchase the Megalodon Shark Cash Card (PS4™) to gain GTA$10,000,000 to spend in the PS4™ version of GTA Online. Cash is king in this town. Solve your money problems and help get what you want across Los Santos and Blaine County with the purchase of cash packs for Grand Theft Auto Online. All purchased cash is automatically deposited into your character’s bank account. Spend wisely, cash therapy is fleeting.","SaleStarted":"2023-02-19","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202211/2113/mCa3ytiMbhVx4ByzmuY1c8lu.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP1004-CUSA00411_00-GTAVCASHPACK000F","Trailer":"","PercentOff":"15%","Completionist":"","genre":"Action, Adventure","PlusPrice":458.15,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202211/2113/mCa3ytiMbhVx4ByzmuY1c8lu.png","OpenCriticURL":"","Title":"GTA Online: Megalodon Shark Cash Card (PS4™)","ESRBRating":"TRD","Publisher":"Rockstar Games","ReleaseDate":"2014-11-16","Slug":"gta-online-megalodon-shark-cash-card-ps4-playstation-tr","IsPS5":1,"Price":539,"MainExtra":"","SalePrice":458.15,"IsPS4":0}]