[{"SCORE":"87","SaleEnds":"2023-09-06","description":"An epic dark fantasy world where the fate of the land is decided by the mighty Eikons and the Dominants who wield them. This is the tale of Clive Rosfield, a warrior granted the title “First Shield of Rosaria” and sworn to protect his younger brother Joshua, the dominant of the Phoenix. Before long, Clive will be caught up in a great tragedy and swear revenge on the Dark Eikon Ifrit, a mysterious entity that brings calamity in its wake.","SaleStarted":"2023-08-22","LowestPrice":"/game/83152","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202211/2904/NspyF8og84Div2VMShXI4cV7.png?w=200","MainStory":35,"platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP0082-PPSA10665_00-FF16SIEE00000002","Trailer":"https://www.youtube.com/watch?v=pXBmjC_YsIU","PercentOff":"20%","Completionist":76,"genre":"Action, Role Playing Games","PlusPrice":1199.2,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202211/2904/NspyF8og84Div2VMShXI4cV7.png","OpenCriticURL":"https://www.metacritic.com/game/playstation-5/final-fantasy-xvi","Title":"FINAL FANTASY XVI","ESRBRating":"TRD","Publisher":"Square Enix LTD","ReleaseDate":"2023-06-21","Slug":"final-fantasy-xvi-ps5-tr","NumberofPlayers":"https://shope.ee/B1EN1S9RM","IsPS5":1,"Price":1499,"MainExtra":57,"SalePrice":1199.2,"IsPS4":0},{"SCORE":"","SaleEnds":"2023-09-06","description":"Digital Deluxe Edition content: FINAL FANTASY XVI Digital Mini Art Book Digital Mini Soundtrack *Digital mini soundtrack and digital mini artbook (the “digital contents”) can only be accessed through “Square Enix Digital Content Viewer”. *Digital contents are available in Japanese and English only. * “Square Enix Digital Content Viewer” may be subject to additional terms and conditions. * “Square Enix Digital Content Viewer” is included in this product and it will be downloaded automatically on the release day. If you have already downloaded “Square Enix Digital Content Viewer”, you can view the digital contents without having to download the “Square Enix Digital Content Viewer” again. *A persistent Internet connection is required to use the “Square Enix Digital Content Viewer” and to access your digital contents. An epic dark fantasy world where the fate of the land is decided by the mighty Eikons and the Dominants who wield them. This is the tale of Clive Rosfield, a warrior granted the title “First Shield of Rosaria” and sworn to protect his younger brother Joshua, the dominant of the Phoenix. Before long, Clive will be caught up in a great tragedy and swear revenge on the Dark Eikon Ifrit, a mysterious entity that brings calamity in its wake. Languages Supported by FINAL FANTASY XVI: Voiceover: Japanese, English, French, Italian, German, Spanish (Latin American) Text and subtitles: Japanese, English, French, Italian, German, Spanish (Latin American), Spanish (Castillian), Polish, Portuguese (Brazilian), Arabic, Russian Languages Supported by the Square Enix Digital Content Viewer: Japanese, English, French, German, Italian, Spanish, Traditional Chinese, Simplified Chinese, Korean Languages Supported by the Digital Mini Artbook & Digital Mini Soundtrack: Japanese, English","SaleStarted":"2023-08-22","LowestPrice":"","Image":"https://image.api.playstation.com/vulcan/ap/rnd/202211/2112/MneyUUiYMwV9pt3Khe2s8GY4.png?w=200","MainStory":"","platform":"Playstation","URL":"https://store.playstation.com/en-tr/product/EP0082-PPSA10665_00-FF16DDXSIEE00001","Trailer":"","PercentOff":"20%","Completionist":"","genre":"Action, Role Playing Games","PlusPrice":1439.2,"MexPrice":"https://image.api.playstation.com/vulcan/ap/rnd/202211/2112/MneyUUiYMwV9pt3Khe2s8GY4.png","OpenCriticURL":"","Title":"FINAL FANTASY XVI Digital Deluxe Edition","ESRBRating":"TRD","Publisher":"Square Enix LTD","ReleaseDate":"2023-06-21","Slug":"final-fantasy-xvi-digital-deluxe-edition-ps5-tr","IsPS5":1,"Price":1799,"MainExtra":"","SalePrice":1439.2,"IsPS4":0}]